Revit 2027 API
Form.IsSideFace Method
Given a face, tell if it is a side face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSideFace(
	Reference faceReference
)
Public Function IsSideFace (
	faceReference As Reference
) As Boolean
public:
bool IsSideFace(
	Reference^ faceReference
)
member IsSideFace :
        faceReference : Reference -> bool
Parameters
faceReference Reference
The reference of the face to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace